{
  "stories": [
    {
      "id": "cinderella",
      "title": "Cinderella",
      "text": "Once upon a time there lived a kind girl named Cinderella. Her mother died, and her father married a proud woman with two daughters who were beautiful in face but hard of heart. They made Cinderella do all the work in the house: she scrubbed the floors, cooked the meals, and slept in the ashes by the hearth. Yet Cinderella remained gentle and good, speaking kindly to all creatures.\n\nOne day the King announced a grand ball for the Prince, inviting all the young maidens of the land. Cinderella longed to go, but her stepmother laughed and piled more chores on her—polish the silver, wash the gowns, and mend the shoes. When the day came, her stepsisters went to the ball in fine dresses, leaving Cinderella in tears by the fireplace.\n\nThen a gentle light filled the kitchen, and a Fairy Godmother appeared. 'Do not cry, child,' she said. With a touch of her wand she turned a pumpkin into a golden coach, mice into prancing horses, a rat into a coachman, and lizards into footmen. She changed Cinderella’s rags into a shimmering gown and placed glass slippers on her feet. 'But remember,' said the Fairy Godmother, 'the magic ends at midnight.'\n\nAt the ball, all eyes turned to the mysterious maiden. The Prince danced with her alone, and they spoke softly in the music and candlelight. Time flew until the clock began to strike twelve. Cinderella fled down the palace steps, leaving behind one glass slipper. The coach turned back into a pumpkin, the horses into mice, and the gown into plain clothes.\n\nThe Prince searched the kingdom with the glass slipper. Many tried, but the shoe fit no one. At last he came to Cinderella’s house. The stepsisters tried to squeeze their feet into the slipper, but it would not go. Then Cinderella asked to try. The slipper fit perfectly. Her Fairy Godmother’s magic returned, and her gown shone like starlight. The Prince recognized her and took her hand with joy.\n\nCinderella forgave her stepsisters and went with the Prince to the palace. They were married with bells and music, and Cinderella lived kindly and happily ever after."
    },
    {
      "id": "snow_white",
      "title": "Snow White",
      "text": "Once upon a time a Queen sat sewing at a window in winter. As she stitched, she pricked her finger, and three drops of blood fell upon the snow on the ebony frame. She wished for a child as white as snow, as red as blood, and as black as ebony. Soon a daughter was born, and she was called Snow White.\n\nAfter the Queen died, the King married a vain woman who had a magic mirror. Each day she asked, 'Mirror, mirror on the wall, who is the fairest of them all?' and the mirror answered truly. When Snow White grew to be more fair, the Queen burned with envy. She ordered a huntsman to take the child into the forest and end her life.\n\nBut the huntsman took pity and let Snow White flee into the woods. There she found a little cottage owned by seven dwarfs. They welcomed her with kind hearts and asked her to keep house while they mined in the mountains. Snow White lived happily with them.\n\nWhen the Queen learned from the mirror that Snow White still lived, she disguised herself and went to the cottage with a poisoned apple. Snow White took a bite and fell into a deep, deathlike sleep. The dwarfs laid her in a crystal coffin on the mountain.\n\nOne day a Prince came by and saw Snow White. Moved by her beauty and sorrow, he asked the dwarfs to let him take the coffin to his castle. As the bearers stumbled, the apple piece dislodged from her throat, and Snow White awoke. The Prince rejoiced and asked her to be his bride. They were married with music and bells, and the wicked Queen’s pride was broken."
    },
    {
      "id": "sleeping_beauty",
      "title": "Sleeping Beauty",
      "text": "A King and Queen longed for a child, and at last a daughter was born. They held a grand feast and invited wise women to bless the child, but one was forgotten. Angered, the uninvited fairy came and cursed the princess: on her fifteenth birthday she would prick her finger on a spindle and fall into a sleep like death. A gentle fairy softened the curse: the princess would sleep for a hundred years, to be awakened by a Prince.\n\nAll spindles were burned, and the child grew graceful and kind. On her fifteenth birthday, the princess found a hidden old woman spinning in a tower. She touched the spindle, pricked her finger, and fell into slumber. The whole castle slept with her; thorns and briars grew high around the walls.\n\nAfter a hundred years, a Prince came and the thorns turned to flowers before him. He found the princess asleep and, filled with love, kissed her. She awoke, as did the castle. They were married that very day, and joy and music filled the halls."
    },
    {
      "id": "rapunzel",
      "title": "Rapunzel",
      "text": "A man and his wife lived beside a walled garden belonging to a powerful enchantress. The wife longed for rampion from the garden. The husband climbed the wall and gathered it, but the enchantress caught him. He pleaded, and she demanded their child in return. When the baby girl was born, the enchantress took her and named her Rapunzel.\n\nWhen Rapunzel grew, the enchantress locked her in a tower with no door, only a window. When she wished to visit, she cried, 'Rapunzel, Rapunzel, let down your hair!' and climbed the golden braid.\n\nA Prince heard the call and one day tried it himself. Rapunzel let down her hair, and he climbed to her window. They spoke softly and fell in love. They planned escape with a ladder of silk. But the enchantress discovered them. She cut off Rapunzel’s hair and banished her to a lonely desert.\n\nWhen the Prince returned, the enchantress let down the shorn braid and he climbed—only to face her wrath. He fell from the tower and was blinded by thorns. Wandering, he came at last to the desert where Rapunzel lived with twins she had borne. Rapunzel’s tears fell upon his eyes, and his sight returned. They went to his kingdom and lived together in joy."
    },
    {
      "id": "beauty_and_the_beast",
      "title": "Beauty and the Beast",
      "text": "A merchant lost his fortune and moved with his children to the countryside. His youngest daughter, Beauty, was gentle and cheerful. On a journey, the merchant sought shelter in a strange castle. As he left, he plucked a single rose for Beauty. A fearsome Beast appeared, condemning him for theft, but agreed to spare him if Beauty came to live at the castle.\n\nBeauty went willingly. The Beast treated her with courtesy, asking each evening if she would marry him; she always answered kindly, 'No, I do not yet love you.' Beauty longed to see her father. The Beast let her visit home for a week, giving her a ring to return. Her jealous sisters delayed her, and Beauty returned late. She found the Beast dying of grief in the garden.\n\nWith tears, she realized she loved him. 'Yes, I will marry you,' she said. At once the Beast transformed into a Prince, freed from a wicked enchantment. They were married with music and light, and Beauty brought her father to live with them in peace."
    },
    {
      "id": "hansel_and_gretel",
      "title": "Hansel and Gretel",
      "text": "A poor woodcutter lived at the edge of a great forest with his two children, Hansel and Gretel. A famine came, and their stepmother urged the father to abandon the children. Hansel heard and filled his pockets with white pebbles. Led into the forest, he dropped stones along the path. After the parents left, the moon rose and the children followed the shining pebbles home.\n\nAgain the stepmother demanded the children be taken away. Hansel, unable to find pebbles, crumbled bread to mark the path, but birds ate the crumbs. Lost in the forest, Hansel and Gretel found a cottage made of bread and cakes, with sugar windows. A witch lived there. She fed them sweets and imprisoned Hansel in a cage, planning to fatten him and eat him.\n\nEach day she felt his finger to test his weight, but he offered a bone, and she was fooled. At last she grew impatient and ordered Gretel to heat the oven. Gretel asked the witch to show her how to look inside; when the witch bent in, Gretel pushed her into the oven and shut the door. She freed Hansel, and they found jewels in the house. They returned home to their father, whose heart had turned from the stepmother’s cruelty. The family lived together in comfort from then on."
    },
    {
      "id": "frog_prince",
      "title": "The Frog Prince",
      "text": "A young princess lost her golden ball in a deep well. A frog offered to fetch it if she would be his companion at table and in bed. She agreed lightly, and the frog brought back the ball. At supper he knocked at the door and asked to be let in, reminding her of her promise. The King commanded his daughter to keep her word.\n\nDisgusted, she let the frog eat from her plate and sleep upon her pillow. In the night she hurled him against the wall in anger—whereupon he turned into a Prince, freed from enchantment by her keeping of the promise and her human passion. He took her to his father’s kingdom, and they lived in honor and affection."
    }
  ]
}
